20260124T095842--kdoc-536-なぜjavascriptが難しく感じるか__essay.org
:properties:
:ID: 20260124T095842
:end:
#+title:      KDOC 536: なぜJavaScriptが難しく感じるか
#+date:       [2026-01-24 Sat 09:58]
#+filetags:   :essay:
#+identifier: 20260124T095842

* この文書のステータス
- 作成
  - [X] 2026-02-21 貴島
- レビュー
  - [X] 2026-02-21 貴島

* 概要

これは向き合って学ぶ前の感想である。未来この気持ちがわからなくなると信じたい。

何が妨げているか明らかにすれば対応もできると考えている。さまざまな感覚の集合からくる「難しい」であって、「難易度が高い」とは異なる可能性もある。ほとんど印象のケースに見える。難易度が高い、にかかるほど熟達はしていない。

プロ登山家が「山登りは難しい」というのと、山に登ったことのない人が「山登りは難しい」というのは全然違う。プロは特定のケースや具体的な知識を思い浮かべているが、そうでない人は漠然とした知識のなさから「難しい」といっている。あまりに知らないことが多いと、難しい、と雑に判断するようになっているようである。

職業人生のなかで、常に2割くらいはJavaScriptを触れてきた。プライベートでもJavaScriptを使っていくつか作ったことがある。の割には親しみのない感覚がある。わからずにそのまま使ってきた印象が強い。それが漠然とした苦手意識につながっているように見える。

- 使うまでの設定、エコシステムが多い。拡張文法、モジュールシステム、トランスパイルターゲット、...。他言語だと選択する機会のないものも、多く選択肢がある。目に入るたびに圧倒されて、「難しい」と感じる
- オブジェクト的、関数的のミックス

ほかの物事と同じく、背後にある概念をつかめば、一気に理解や親しみが増えると信じている。

* 関連

- 具体例: [[id:20260122T084216][KDOC 535: CommonJSとESMはモジュールシステムである]]。組み合わせの例
