20260124T095842--kdoc-536-なぜjavascriptが難しく感じるか__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-26T09:15:57Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 536: なぜJavaScriptが難しく感じるか</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 536: なぜJavaScriptが難しく感じるか</h1>
<div id="outline-container-org2ccc873" class="outline-2">
<h2 id="org2ccc873"><a href="#org2ccc873">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2ccc873">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-21 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-21 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc2c0ef0" class="outline-2">
<h2 id="orgc2c0ef0"><a href="#orgc2c0ef0">概要</a></h2>
<div class="outline-text-2" id="text-orgc2c0ef0">
<p>
これは向き合って学ぶ前の感想である。未来この気持ちがわからなくなると信じたい。
</p>

<p>
何が妨げているか明らかにすれば対応もできると考えている。さまざまな感覚の集合からくる「難しい」であって、「難易度が高い」とは異なる可能性もある。ほとんど印象のケースに見える。難易度が高い、にかかるほど熟達はしていない。
</p>

<p>
プロ登山家が「山登りは難しい」というのと、山に登ったことのない人が「山登りは難しい」というのは全然違う。プロは特定のケースや具体的な知識を思い浮かべているが、そうでない人は漠然とした知識のなさから「難しい」といっている。あまりに知らないことが多いと、難しい、と雑に判断するようになっているようである。
</p>

<p>
職業人生のなかで、常に2割くらいはJavaScriptを触れてきた。プライベートでもJavaScriptを使っていくつか作ったことがある。の割には親しみのない感覚がある。わからずにそのまま使ってきた印象が強い。それが漠然とした苦手意識につながっているように見える。
</p>

<ul class="org-ul">
<li>使うまでの設定、エコシステムが多い。拡張文法、モジュールシステム、トランスパイルターゲット、&#x2026;。他言語だと選択する機会のないものも、多く選択肢がある。目に入るたびに圧倒されて、「難しい」と感じる</li>
<li>オブジェクト的、関数的のミックス</li>
</ul>

<p>
ほかの物事と同じく、背後にある概念をつかめば、一気に理解や親しみが増えると信じている。
</p>
</div>
</div>
<div id="outline-container-orgb718c72" class="outline-2">
<h2 id="orgb718c72"><a href="#orgb718c72">関連</a></h2>
<div class="outline-text-2" id="text-orgb718c72">
<ul class="org-ul">
<li>具体例: <a href="20260122T084216--kdoc-535-commonjsとesmはモジュールシステムである__permanent.html#ID-20260122T084216">KDOC 535: CommonJSとESMはモジュールシステムである</a>。組み合わせの例</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
